from main import run
from draw import change_lim
print("분자 3D 모델링 프로그램")

BeF2 =[["F","=","Be","=","F"]]

BF3=[[" "," ","F"," "," "]
    ,[" "," ","-"," "," "]
    ,["F","-","B","-","F"]]

O2 = [["O","=","O"]]

CO2=[["O","=","C","=","O"]]

H2O=[["H","-","O","-","H"]]

NH3=[[" "," ","H"," "," "]
    ,[" "," ","-"," "," "]
    ,["H","-","N","-","H"]]

CH4 = [[" "," ","H"," "," "]
      ,[" "," ","-"," "," "]
      ,["H","-","C","-","H"]
      ,[" "," ","-"," "," "]
      ,[" "," ","H"," "," "]]

CH3COOH = [[" "," ","H"," ","O"," "," "," "," "]
          ,[" "," ","-"," ","="," "," "," "," "]
          ,["H","-","C","-","C","-","O","-","H"]
          ,[" "," ","-"," "," "," "," "," "," "]
          ,[" "," ","H"," "," "," "," "," "," "]]

C2H5OH =  [[" "," ","H"," ","H"," "," "," "," "]
          ,[" "," ","-"," ","-"," "," "," "," "]
          ,["H","-","C","-","C","-","O","-","H"]
          ,[" "," ","-"," ","-"," "," "," "," "]
          ,[" "," ","H"," ","H"," "," "," "," "]]

HCHO=[[" "," ","O"," "," "]
     ,[" "," ","="," "," "]
     ,["H","-","C","-","H"]]

CH3COCH3 =[[" "," ","H"," ","O"," ","H"," "," "]
          ,[" "," ","-"," ","="," ","-"," "," "]
          ,["H","-","C","-","C","-","C","-","H"]
          ,[" "," ","-"," "," "," ","-"," "," "]
          ,[" "," ","H"," "," "," ","H"," "," "]]

n=10
while True:
    print("그리기 / 축설정 / 끝내기")
    cmd = input(">>> ")
    if cmd=="축설정":
        try:
            n = int(input("크기를 입력해주세요(기본값 : 10)\n>> "))
        except: "잘못된 값이 입력되었습니다"
    elif cmd=="그리기":
        change_lim(n)
        print("저장된 분자의 화학식을 입력해주시거나, 구조식을 직접 입력하고 싶으시면 \"직접입력\"을 써주세요")
        print("저장된 분자 : O2 CO2 BeF2 BF3 CH4 NH3 H2O C2H5OH CH3COOH HCHO CH3COCH3")
        print("저장된 분자를 모두 출력하시려면 \"모두출력\" 을 입력해주세요")
        cmd = input(">> ")
        if cmd == "직접입력":
            print("표현 가능한 원소 목록 : H C N O F Si P S Cl Br I / Be B")
            print("결합 표현/ 단일결합: - , 이중결합: = , 삼중결합: +")
            print("입력을 완료했으면 \"end\"를 입력해주세요")
            result=[]
            while True:
                cmd = input()
                if cmd == "end": break
                result.append(list(cmd))
            if result:
                try:
                    run(result)
                except: print("입력이 잘못되었습니다")
        elif cmd in ["O2","CO2","BeF2","BF3","CH4","NH3","H2O","C2H5OH","CH3COOH","HCHO","CH3COCH3"]:
            run(globals()[cmd])
        elif cmd == "모두출력":
            for cmd in ["O2","CO2","BeF2","BF3","CH4","NH3","H2O","C2H5OH","CH3COOH","HCHO","CH3COCH3"]:
                run(globals()[cmd])
    elif cmd == "끝내기":
        break